#3. Задайте список из вещественных чисел. 
# Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

N = int(float("Размер списка: "))

list = []

for i in range(N):
    list.append(i)

print(list)